tutorial/hardwood/poplar(Zhang2016)/20K/RACLC/system/save/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;
setFormat raw;
sets
(
mid
{
  type uniform;
  axis y;
  start ( 0 -0.0375 1.4 );
  end ( 0 0.0375 1.4 );
  nPoints 10;
}
);
fields ( U);
// ************************************************************************* //
